[
    {
        "index": 1,
        "options": [
            {
                "id": 1,
                "text": "Old movies were very different from today's movies."
            },
            {
                "id": 2,
                "text": "That's because the movies were only in black and white, and sometimes without sound."
            },
            {
                "id": 3,
                "text": "Not only did these technological limitations exist, the movies were also low budget."
            },
            {
                "id": 4,
                "text": "Due to the lack of money, actors also had few opportunities to earn money through acting."
            },
            {
                "id": 5,
                "text": "Now things have changed, actors and filmmakers can earn thousands of dollars from film production."
            }
        ],
        "questionText": "Films"
    },
    {
        "index": 2,
        "options": [
            {
                "id": 1,
                "text": "It was held on Saturday morning, there was a 10 km race for adults."
            },
            {
                "id": 2,
                "text": "There were 60 participants, in which Ms. Kamus kept the fastest speed and won."
            },
            {
                "id": 3,
                "text": "After she received the prize, the following time was for children's activities."
            },
            {
                "id": 4,
                "text": "Activities including football, swimming, skipping rope, and the children played together very happily."
            },
            {
                "id": 5,
                "text": "After playing, the children were very hungry and ate with their parents."
            }
        ],
        "questionText": "Weekend activities"
    },
    {
        "index": 3,
        "options": [
            {
                "id": 1,
                "text": "He is a famous singer who is loved by many fans."
            },
            {
                "id": 2,
                "text": "At the age of fifteen, he studied music at a special school."
            },
            {
                "id": 3,
                "text": "Before becoming famous, he had to practice very hard every day."
            },
            {
                "id": 4,
                "text": "With his unique style and clothes, he soon attracted attention."
            },
            {
                "id": 5,
                "text": "Thanks to his talent and personality, he became well-known to a large audience."
            }
        ],
        "questionText": "The famous singer"
    },
    {
        "index": 4,
        "options": [
            {
                "id": 1,
                "text": "It took place on Sunday morning in the park, there was a race for adults."
            },
            {
                "id": 2,
                "text": "Sixty people took part, and among them, Ms Kamus kept the fastest pace and won the race."
            },
            {
                "id": 3,
                "text": "After she got her prize, the next part was for children's activities."
            },
            {
                "id": 4,
                "text": "The activities were football, swimming, skipping, and more, and the kids had fun playing together."
            },
            {
                "id": 5,
                "text": "After the games, the kids were really hungry and ate with their parents."
            }
        ],
        "questionText": "Family sports day"
    },
    {
        "index": 5,
        "options": [
            {
                "id": 1,
                "text": "Before writing about a place, you need to do some research on it."
            },
            {
                "id": 2,
                "text": "It is important to learn about the people and the history there carefully."
            },
            {
                "id": 3,
                "text": "Even if you can not visit the place, your writing will still look similar to real experiences."
            },
            {
                "id": 4,
                "text": "You should also compare that place with your own country."
            },
            {
                "id": 5,
                "text": "Such comparisons will make your writing more interesting and meaningful."
            }
        ],
        "questionText": "Writing about a place"
    },
    {
        "index": 6,
        "options": [
            {
                "id": 1,
                "text": "Movies today are very different from movies in the past."
            },
            {
                "id": 2,
                "text": "In the old days, films were only in black and white, and sometimes even without sound."
            },
            {
                "id": 3,
                "text": "In addition to these technological limits, producers had very low budgets."
            },
            {
                "id": 4,
                "text": "Because of the lack of money, actors also earn little money from acting."
            },
            {
                "id": 5,
                "text": "Nowadays, everything has changed: actors and producers can earn a lot of money from producing films."
            }
        ],
        "questionText": "Movies then and now"
    },
    {
        "index": 7,
        "options": [
            {
                "id": 1,
                "text": "In the past, transportation was primarily accessible to the wealthy."
            },
            {
                "id": 2,
                "text": "Later, air travel became popular among business professionals."
            },
            {
                "id": 3,
                "text": "Eventually, buses and trains were introduced as affordable alternatives."
            },
            {
                "id": 4,
                "text": "These made traveling more accessible to everyone."
            },
            {
                "id": 5,
                "text": "Today, buses and trains are among the most common transportation options."
            }
        ],
        "questionText": "The history of transportation"
    },
    {
        "index": 8,
        "options": [
            {
                "id": 1,
                "text": "I arrived at the shop early in the morning, but it was crowded with people."
            },
            {
                "id": 2,
                "text": "A waiter assisted me in finding a table and handed me the menu."
            },
            {
                "id": 3,
                "text": "The menu was not as good as expected and quite pricey, so I decided to order a sandwich."
            },
            {
                "id": 4,
                "text": "The sandwich was both delicious and beautifully presented."
            },
            {
                "id": 5,
                "text": "I might return to try different types of drinks next time."
            }
        ],
        "questionText": "New coffee shop"
    },
    {
        "index": 9,
        "options": [
            {
                "id": 1,
                "text": "Over the past decade, artificial intelligence has revolutionized various industries."
            },
            {
                "id": 2,
                "text": "The early AI systems were limited to simple pattern recognition tasks."
            },
            {
                "id": 3,
                "text": "High computational costs previously hindered the development of AI."
            },
            {
                "id": 4,
                "text": "Nowadays, AI engineers build advanced models for complex tasks such as language translation."
            },
            {   
                "id": 5,
                "text": "Modern AI tools help businesses to analyze data and make better decisions."
            }
        ],
        "questionText": "Artificial intelligence"
    },
    {
        "index": 10,
        "options": [
            {
                "id": 1,
                "text": "This month, the wellness day took place on Friday, focusing on work-life balance."
            },
            {
                "id": 2,
                "text": "More than 50 employees participated, with Mr.A leading a workshop on stress relief."
            },
            {
                "id": 3,
                "text": "Activities included team yoga, time management seminars, and a group walk."
            },
            {
                "id": 4,
                "text": "After the workshops, awards were given for the most creative wellness ideas."
            },
            {
                "id": 5,
                "text": "Employees enjoyed healthy snacks and exchanged tips for managing stress."
            }    
        ],
        "questionText": "Company wellness day"
    },
    {
        "index": 11,
        "options": [
            {
                "id": 1,
                "text": "Flexible work models are becoming more common in modern workplaces."
            },
            {
                "id": 2,
                "text": "Previously, employees were confined to rigid nine-to-five work hours."
            },
            {
                "id": 3,
                "text": "Technological restrictions once made remote work a challenge."
            },
            {
                "id": 4,
                "text": "Managers now utilize software to monitor project progress remotely."
            },
            {   
                "id": 5,
                "text": "Today, businesses are exploring shorter workweeks to boost productivity."
            }
        ],
        "questionText": "Workplace evolution"
    },  
    {
        "index": 12,
        "options": [
            {
                "id": 1,
                "text": "The event was fully planned, financed, and supported by local authorities."
            },
            {
                "id": 2,
                "text": "As a result, entry was free, and around five thousand people attended."
            },
            {
                "id": 3,
                "text": "Many attendees arrived early and browsed local shops before the event began."
            },
            {
                "id": 4,
                "text": "Despite the busy day, workers finished ahead of schedule and watched the famous singer perform."
            },
            {   
                "id": 5,
                "text": "The two-hour performance thrilled the audience, leaving everyone in high spirits."
            }
        ],
        "questionText": "Music show at the park"
    },
    {
        "index": 13,
        "options": [
            {
                "id": 1,
                "text": "Mae's father worked as a nurse, and her mother was a teacher."
            },
            {
                "id": 2,
                "text": "Her parents motivated Mae to pursue higher education and focus on scientific studies."
            },
            {
                "id": 3,
                "text": "Mae worked diligently and achieved several remarkable milestones."
            },
            {
                "id": 4,
                "text": "She later joined a team, contributing her skills and knowledge."
            },
            {   
                "id": 5,
                "text": "Eventually, she had the opportunity to undergo a training program in the United States."
            }
        ],
        "questionText": "Mae - The Math Girl"
    },
    {
        "index": 14,
        "options": [
            {
                "id": 1,
                "text": "The Internet of Things (IoT) links everyday devices to improve their capabilities."
            },
            {
                "id": 2,
                "text": "Early IoT devices faced limitations due to slow internet speeds and compatibility challenges."
            },
            {
                "id": 3,
                "text": "High development costs previously slowed the widespread adoption of IoT technology."
            },
            {
                "id": 4,
                "text": "Nowadays, engineers create smart devices for both residential and industrial applications."
            },
            {   
                "id": 5,
                "text": "Modern IoT systems provide real-time data tracking and automation features."
            }
        ],
        "questionText": "IoT - Internet of Things"
    },
    {
        "index": 15,
        "options": [
            {
                "id": 1,
                "text": "I decided to try a new café located at the end of the street."
            },
            {
                "id": 2,
                "text": "The place was quite busy, with a lively atmosphere."
            },
            {
                "id": 3,
                "text": "Even so, a staff member quickly noticed me and brought over the menu."
            },
            {
                "id": 4,
                "text": "I was a bit surprised to see that there were only a few items to choose from."
            },
            {   
                "id": 5,
                "text": "In the end, I went for the most expensive salad on the menu."
            }
        ],
        "questionText": "Eating at restaurant"
    },
    {
        "index": 16,
        "options": [
            {
                "id": 1,
                "text": "First, we prepared the materials for our group presentation."
            },
            {
                "id": 2,
                "text": "Then, we presented our topic for 10 minutes."
            },
            {
                "id": 3,
                "text": "Throughout the presentation, we used images to explain our ideas."
            },
            {
                "id": 4,
                "text": "After the presentation, other students asked questions."
            },
            {   
                "id": 5,
                "text": "Finally, each group member took turns answering the questions."
            }
        ],
        "questionText": "A group presentation"
    },
    {
        "index": 17,
        "options": [
            {
                "id": 1,
                "text": "In the past, most workers followed fixed schedules from nine to five."
            },
            {
                "id": 2,
                "text": "Because technology was limited, working from home was almost impossible."
            },
            {
                "id": 3,
                "text": "Modern offices are now moving toward more flexible ways of working."
            },
            {
                "id": 4,
                "text": "Managers now use digital tools to follow project progress remotely."
            },
            {   
                "id": 5,
                "text": "Many companies today are trying shorter workweeks to increase efficiency."
            }
        ],
        "questionText": "Workplace evolution (2)"
    },
    {
        "index": 18,
        "options": [
            {
                "id": 1,
                "text": "Encouraged by her parents, she decided to study science at university."
            },
            {
                "id": 2,
                "text": "Her strong academic record earned her a place in a training program in the United States."
            },
            {
                "id": 3,
                "text": "Her passion for space led Mae to join a dedicated research team."
            },
            {
                "id": 4,
                "text": "As a member of the team, she traveled into space and carried out numerous experiments."
            },
            {   
                "id": 5,
                "text": "Some of these experiments involved growing plants and observing animals aboard the spacecraft."
            }
        ],
        "questionText": "The first american woman in space"    
    },
    {
        "index": 19,
        "options": [
            {
                "id": 1,
                "text": "In the past, slow internet speeds made streaming or uploading videos difficult."
            },
            {
                "id": 2,
                "text": "Early platforms offered only basic features like text posts and simple images."
            },
            {
                "id": 3,
                "text": "Over time, social media platforms have greatly evolved in both design and functionality."
            },
            {
                "id": 4,
                "text": "Today's platforms use complex algorithms to personalize and shape each user's feed."
            },
            {   
                "id": 5,
                "text": "Many influencers now earn income primarily through brand sponsorships and online ads."
            }    
        ],
        "questionText": "Social Media"
    },
    {
        "index": 20,
        "options": [
            {
                "id": 1,
                "text": "Before the open day, please contact us by phone or email so we can record your personal details."
            },
            {
                "id": 2,
                "text": "Using this information, we'll prepare an identification card for you to collect upon arrival."
            },
            {
                "id": 3,
                "text": "You'll need to show this card to enter the introductory talk and morning lectures."
            },
            {
                "id": 4,
                "text": "Every visitor will have the chance to join a Q&A session with current students."
            },
            {   
                "id": 5,
                "text": "After the presentations, you'll be able to explore different departments across the campus."
            }
        ],
        "questionText": "University open day"
    },
    {
        "index": 21,
        "options": [
            {
                "id": 1,
                "text": "Over the past decade, artificial intelligence has reshaped industries around the world."
            },
            {
                "id": 2,
                "text": "Early AI systems were capable of handling only simple pattern recognition tasks."
            },
            {
                "id": 3,
                "text": "In the past, high computational costs slowed down the progress of AI development."
            },
            {
                "id": 4,
                "text": "Today, AI engineers design sophisticated models for applications such as language translation."
            },
            {   
                "id": 5,
                "text": "Modern AI tools enable businesses to analyze vast amounts of data and make smarter decisions."
            }
        ],
        "questionText": "AI - Artificial Intelligence"
    },
    {
        "index": 22,
        "options": [
            {
                "id": 1,
                "text": "In the past, many meals were high in sugar and unhealthy fats."
            },
            {
                "id": 2,
                "text": "Years ago, limited access to fresh produce made healthy eating more difficult."
            },
            {
                "id": 3,
                "text": "Modern diets now focus on fresh, whole foods instead of processed ones."
            },
            {
                "id": 4,
                "text": "Nutritionists today teach people how to plan balanced and nutritious meals."
            },
            {   
                "id": 5,
                "text": "Nowadays, mobile apps help users track calories and discover healthy recipes."
            }
        ],
        "questionText": "Healthy Eating"    
    },
    {
        "index": 23,
        "options": [
            {
                "id": 1,
                "text": "The wellness fair took place on Saturday afternoon, encouraging people to adopt healthier lifestyles."
            },
            {
                "id": 2,
                "text": "More than 66 participants joined the event, with Dr. Nam leading an engaging fitness workshop."
            },
            {
                "id": 3,
                "text": "The fair also included activities like cooking demonstrations, mindfulness sessions, and a fun run."
            },
            {
                "id": 4,
                "text": "After the workshops, prizes were awarded to participants who created the most creative health posters."
            },
            {   
                "id": 5,
                "text": "Families enjoyed tasting healthy snacks and discovering practical tips for better overall wellness."
            }    
        ],
        "questionText": "Wellness Fair"
    },
    {
        "index": 24,
        "options": [
            {
                "id": 1,
                "text": "He is a famous singer."
            },
            {
                "id": 2,
                "text": "Before becoming famous, he studied music at school when he was 15."
            },
            {
                "id": 3,
                "text": "His unique way of dressing and performing made him stand out from others."
            },
            {
                "id": 4,
                "text": "This helped him receive many invitations for collaborations and performances."
            },
            {   
                "id": 5,
                "text": "He eventually became famous among audiences around the world."
            }    
        ],
        "questionText": "The famous singer (2)"
    },
    {
        "index": 25,
        "options": [
            {
                "id": 1,
                "text": "He is a famous singer who is loved by many people."
            },
            {
                "id": 2,
                "text": "Before becoming famous, he studied music at school when he was 15 years old."
            },
            {
                "id": 3,
                "text": "He spent years practicing and improving his performance skills."
            },
            {
                "id": 4,
                "text": "His unique clothing style and stage presence made him stand out."
            },
            {   
                "id": 5,
                "text": "Because of this, more and more people began to recognize and admire him."
            }    
        ],
        "questionText": "The famous singer (3)"
    },
    {
        "index": 26,
        "options": [
            {
                "id": 1,
                "text": "Before writing, it is important to research the place thoroughly."
            },
            {
                "id": 2,
                "text": "To prepare well, you should learn about the people and the history of the area."
            },
            {
                "id": 3,
                "text": "Sometimes you may not be able to visit the place, but you can still find similar information from other sources."
            },
            {
                "id": 4,
                "text": "Comparing that place with your own country can be very helpful."
            },
            {   
                "id": 5,
                "text": "This comparison will help you gain a deeper understanding and write more effectively."
            }    
        ],
        "questionText": "Writing about a place (2)"
    },
    {
        "index": 27,
        "options": [
            {
                "id": 1,
                "text": "The café was very crowded when the customer arrived."
            },
            {
                "id": 2,
                "text": "The staff helped them find a table and handed them a menu."
            },
            {
                "id": 3,
                "text": "The customer was surprised because the menu was different from what they had expected."
            },
            {
                "id": 4,
                "text": "They decided to order the most expensive item — a sandwich."
            },
            {   
                "id": 5,
                "text": "The customer said the sandwich was delicious and that they would definitely come back again."
            }    
        ],
        "questionText": "Busy coffee shop"
    },
    {
        "index": 28,
        "options": [
            {
                "id": 1,
                "text": "It was my first time visiting a new local coffee shop."
            },
            {
                "id": 2,
                "text": "At first, I didn't think it would be good, but I decided to give it a try."
            },
            {
                "id": 3,
                "text": "I looked at the menu and saw many different kinds of food and drinks."
            },
            {
                "id": 4,
                "text": "I chose one dish to try for myself."
            },
            {   
                "id": 5,
                "text": "When I tasted it, I found it really delicious and knew I would come back again."
            }    
        ],
        "questionText": "My visit to a new coffee shop"
    },
    {
        "index": 29,
        "options": [
            {
                "id": 1,
                "text": "The company offers flexible working hours to better support employees' schedules."
            },
            {
                "id": 2,
                "text": "Her white desk stands out in the shared open office."
            },
            {
                "id": 3,
                "text": "She uses a planner to organize her tasks throughout the shorter workweek."
            },
            {
                "id": 4,
                "text": "At lunchtime, she enjoys a homemade sandwich prepared with fresh ingredients."
            },
            {   
                "id": 5,
                "text": "In the evenings, they unwind by reading books on productivity and well-being."
            }    
        ],
        "questionText": "Work"
    },
    {
        "index": 30,
        "options": [
            {
                "id": 1,
                "text": "The cultural fair was held on Sunday, celebrating and showcasing local traditions."
            },
            {
                "id": 2,
                "text": "About 44 participants took part, with Ms.A leading a traditional dance group."
            },
            {
                "id": 3,
                "text": "The event featured pottery workshops, folk music performances, and food tastings."
            },
            {
                "id": 4,
                "text": "Families enjoyed taking photos and sharing delicious local dishes together."
            },
            {   
                "id": 5,
                "text": "At the end of the event, prizes were given to participants with the best costumes."
            }    
        ],
        "questionText": "Cultural festival"
    },
    {
        "index": 31,
        "options": [
            {
                "id": 1,
                "text": "In the past, many cities had fewer bus routes because of budget limitations."
            },
            {
                "id": 2,
                "text": "Older buses often didn't have air conditioning or comfortable seating."
            },
            {
                "id": 3,
                "text": "City buses today are much more efficient than those from ten years ago."
            },
            {
                "id": 4,
                "text": "Drivers and staff now receive better training to provide improved passenger service."
            },
            {   
                "id": 5,
                "text": "Modern buses often use electric power, helping to reduce pollution in urban areas."
            }    
        ],
        "questionText": "Public Transportations"
    },
    {
        "index": 32,
        "options": [
            {
                "id": 1,
                "text": "Modern tourism now provides far more choices than in the past."
            },
            {
                "id": 2,
                "text": "In earlier times, travelers mostly depended on guidebooks and paper maps."
            },
            {
                "id": 3,
                "text": "Back then, limited technology also meant that booking options were quite restricted."
            },
            {
                "id": 4,
                "text": "Today, online platforms allow people to plan thoroughly and book their trips with ease."
            },
            {   
                "id": 5,
                "text": "Moreover, local guides now offer personalized tours that give visitors more authentic experiences."
            }    
        ],
        "questionText": "Tourism"
    },
    {
        "index": 33,
        "options": [
            {
                "id": 1,
                "text": "When I arrived, the place was very crowded, and the staff were extremely busy on the first day."
            },
            {
                "id": 2,
                "text": "Even though it was crowded, the staff still managed to find a table for me."
            },
            {
                "id": 3,
                "text": "They handed me the menu, and when I looked through it, I saw quite a variety of dishes."
            },
            {
                "id": 4,
                "text": "After checking them all, I decided to order the most expensive sandwich."
            },
            {   
                "id": 5,
                "text": "It tasted really good with melted cheese on top, and I'll definitely come back to this place again."
            }    
        ],
        "questionText": "New coffee shop (2)"
    },
    {
        "index": 34,
        "options": [
            {
                "id": 1,
                "text": "In the past, many meals were high in sugar and unhealthy fats."
            },
            {
                "id": 2,
                "text": "Years ago, limited access to fresh produce made healthy eating much more challenging."
            },
            {
                "id": 3,
                "text": "Modern diets now emphasize fresh, whole foods instead of processed ones."
            },
            {
                "id": 4,
                "text": "Nutritionists today teach people how to create balanced and nutritious meal plans."
            },
            {   
                "id": 5,
                "text": "Nowadays, mobile apps help users track calories and discover healthy recipes to support better lifestyles."
            }    
        ],
        "questionText": "Healthy eating"
    },
    {
        "index": 35,
        "options": [
            {
                "id": 1,
                "text": "The tech fair took place on Saturday morning, showcasing a variety of exciting new gadgets."
            },
            {
                "id": 2,
                "text": "More than 66 exhibitors participated, with Mr. Nam presenting an impressive robot demonstration."
            },
            {
                "id": 3,
                "text": "The event featured engaging activities such as VR gaming, coding workshops, and thrilling drone races."
            },
            {
                "id": 4,
                "text": "After the demonstrations, awards were given to the creators of the most innovative products."
            },
            {   
                "id": 5,
                "text": "Visitors enjoyed complimentary coffee and snacks while exploring the interactive exhibits."
            }    
        ],
        "questionText": "Tech fair"
    },
    {
        "index": 36,
        "options": [
            {
                "id": 1,
                "text": "Your end-of-term project should focus on at least two of the given topics."
            },
            {
                "id": 2,
                "text": "It must include relevant pictures along with your own written text about the subject."
            },
            {
                "id": 3,
                "text": "You will then use these pictures and your written work to create a class presentation."
            },
            {
                "id": 4,
                "text": "During the presentation, you should summarize your main points, and it should last about five minutes."
            },
            {   
                "id": 5,
                "text": "Afterward, your classmates will have the opportunity to ask questions, and you will respond to them.e"
            }    
        ],
        "questionText": "End of term project"
    },
    {
        "index": 37,
        "options": [
            {
                "id": 1,
                "text": "Today will begin at 10 a.m. with a short presentation."
            },
            {
                "id": 2,
                "text": "At the end of the presentation, you will meet the heads of departments and lecturers."
            },
            {
                "id": 3,
                "text": "These staff members will take you on a tour of the school's buildings and sports facilities in small groups."
            },
            {
                "id": 4,
                "text": "During this tour, you will need to stay with these students until lunchtime."
            },
            {   
                "id": 5,
                "text": "This meal will be provided on the second floor of the engineering building."
            }    
        ],
        "questionText": "College Welcoming Day"
    }
]